In [1]:
import pandas as pd
df1 = pd.read_csv('Auto.csv')
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [4]:
# jupyter notebook/pycharm/vscode - local machine

In [5]:
pwd

'/Users/trainer/30-08-2025_8pm'

In [ ]:
# after executing pwd --> C:\\uses\Jyoti\ 
# you need to open this folder from navigating inside this pc 
# This Pc --> C --> users --> Jyoti 
# Keep Auto.csv file in that folder ( paste Auto.csv from downloads to the above folder )

In [6]:
df1 = pd.read_csv(r'/Users/trainer/Downloads/Auto.csv') # right click on file --> copy as path (ctrl + shift +c --> windows 11 )
df1.head() # by default top 5 records in Auto.csv ( rows / observations/ datapoints )

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [ ]:
# pd.read_excel('filename.xlsx')
# your extension of the file and function should match

In [ ]:
# year : 1970, 1-1-1970

In [7]:
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320

In [8]:
df1.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino
5,NaN,8.0,NaN,198,4341,10.0,70,1,ford galaxie 500
6,NaN,8.0,NaN,220,4354,9.0,70,1,chevrolet impala
7,14.0,8.0,NaN,215,4312,8.5,70,1,plymouth fury iii
8,14.0,8.0,455.0,225,4425,10.0,70,1,pontiac catalina
9,15.0,8.0,390.0,190,3850,8.5,70,1,amc ambassador dpl

In [9]:
df1.tail() # bottom 5 records by default

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
392,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
393,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
394,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

In [10]:
df1.tail(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

In [11]:
df1.tail(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
387,26.0,4.0,156.0,92,2585,14.5,82,1,chrysler lebaron medallion
388,22.0,6.0,232.0,112,2835,14.7,82,1,ford granada l
389,32.0,4.0,144.0,96,2665,13.9,82,3,toyota celica gt
390,36.0,4.0,135.0,84,2370,13.0,82,1,dodge charger 2.2
391,27.0,4.0,151.0,90,2950,17.3,82,1,chevrolet camaro
392,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
393,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
394,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

#### Analyse Dataset

In [12]:
df1.shape # rows and columns

(397, 9)

In [15]:
df1.head(7)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino
5,NaN,8.0,NaN,198,4341,10.0,70,1,ford galaxie 500
6,NaN,8.0,NaN,220,4354,9.0,70,1,chevrolet impala

In [13]:
df1.dtypes # numbers: int/float; strings:object

mpg             float64
cylinders       float64
displacement    float64
Horse Power      object
weight            int64
acceleration    float64
year              int64
origin            int64
name             object
dtype: object

In [17]:
import numpy as np 
np.array([1,2,3,4,5,'abc']) # U --> Strings

array(['1', '2', '3', '4', '5', 'abc'], dtype='<U21')

In [18]:
df1.isnull()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,True,False,False,False,False,False,False,False,False
3,True,False,True,False,False,False,False,False,False
4,True,False,True,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
392,False,False,False,False,False,False,False,False,False
393,False,False,False,False,False,False,False,False,False
394,False,False,False,False,False,False,False,False,False
395,False,False,False,False,False,False,False,False,False
396,False,False,False,False,False,False,False,False,False

In [19]:
df1.isnull().sum() # it will count how many True appeared in each column

mpg             5
cylinders       3
displacement    5
Horse Power     0
weight          0
acceleration    0
year            0
origin          0
name            0
dtype: int64

In [20]:
df1.count() # 397 total records

mpg             392
cylinders       394
displacement    392
Horse Power     397
weight          397
acceleration    397
year            397
origin          397
name            397
dtype: int64

In [21]:
df1.columns

Index(['mpg', 'cylinders', 'displacement', 'Horse Power', 'weight',
       'acceleration', 'year', 'origin', 'name'],
      dtype='object')

In [22]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     394 non-null    float64
 2   displacement  392 non-null    float64
 3   Horse Power   397 non-null    object
 4   weight        397 non-null    int64
 5   acceleration  397 non-null    float64
 6   year          397 non-null    int64
 7   origin        397 non-null    int64
 8   name          397 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.0+ KB

In [24]:
df1.describe() # int/float columns

,mpg,cylinders,displacement,weight,acceleration,year,origin
count,392.000000,394.000000,392.000000,397.000000,397.000000,397.000000,397.000000
mean,23.611735,5.439086,191.080357,2970.261965,15.555668,75.994962,1.574307
std,7.827466,1.693452,102.452019,847.904119,2.749995,3.690005,0.802549
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,100.750000,2223.000000,13.800000,73.000000,1.000000
50%,23.000000,4.000000,145.500000,2800.000000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,260.000000,3609.000000,17.100000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [25]:
# to take subset in dataframe --> []
# output in pandas mostly will be Series

In [28]:
df1['mpg']

0      18.0
1      15.0
2       NaN
3       NaN
4       NaN
       ...
392    27.0
393    44.0
394    32.0
395    28.0
396    31.0
Name: mpg, Length: 397, dtype: float64

In [30]:
df1[['mpg','acceleration','weight']] # outer square bracket --> take subset; Inner Square bracket --> multiple column names

      mpg  acceleration  weight
0    18.0          12.0    3504
1    15.0          11.5    3693
2     NaN          11.0    3436
3     NaN          12.0    3433
4     NaN          10.5    3449
..    ...           ...     ...
392  27.0          15.6    2790
393  44.0          24.6    2130
394  32.0          11.6    2295
395  28.0          18.6    2625
396  31.0          19.4    2720

[397 rows x 3 columns]

In [32]:
df1['mpg'].mean() # average

23.611734693877548

In [33]:
df1[['mpg','acceleration','weight']].min()

mpg                9.0
acceleration       8.0
weight          1613.0
dtype: float64

#### Feature Engineering

In [34]:
# SQL price * quantity as Sale

In [35]:
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320

In [37]:
df1['col1'] =  df1['acceleration'] + df1['origin'] # +, -, *, /, //, %, **
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,13.0
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,12.5

In [39]:
df1['col2'] = df1['acceleration'] ** 2 # if new name was given python will create it
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,13.0,144.00
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,12.5,132.25
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,12.0,121.00
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst,13.0,144.00
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino,11.5,110.25

In [41]:
df1['col2'] = df1['acceleration'] ** 3 # if older name was given python overwrites it
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,13.0,1728.000
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,12.5,1520.875

#### Cleaning Dataset

In [ ]:
# to change from one data type to another type 
# astype : valid data type changes can be done using astype : int <--> float
# to_numeric : to handle invalid numeric data type change

In [47]:
df1['col4'] =  df1['acceleration'].astype(int)
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col4
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,13.0,1728.000,12
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,12.5,1520.875,11

In [51]:
df1['Horse Power'].astype(int)

ValueError: invalid literal for int() with base 10: '?'

In [50]:
int('?')

ValueError: invalid literal for int() with base 10: '?'

In [52]:
pd.to_numeric(df1['Horse Power'])

ValueError: Unable to parse string "?" at position 32

In [53]:
df1['Horse Power'].isnull().sum() # there are no missing values

0

In [54]:
df1['Horse Power'] = pd.to_numeric(df1['Horse Power'], errors = 'coerce')
# coerce --> forceful --> if conversion is not possible remove that value (creating empty/blank)

In [55]:
df1['Horse Power'].isnull().sum() # after conversion 5 missing vlaues

5

In [56]:
df1.dtypes

mpg             float64
cylinders       float64
displacement    float64
Horse Power     float64
weight            int64
acceleration    float64
year              int64
origin            int64
name             object
col1            float64
col2            float64
col4              int64
dtype: object

In [ ]:
## Missing Values / Null (SQL) / Blanks / NaN / Empty

In [57]:
# remove rows where blank values 
# replace Blank with something else

In [58]:
df1.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col4
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,13.0,1728.000,12
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,12.5,1520.875,11
2,NaN,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,12.0,1331.000,11
3,NaN,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,13.0,1728.000,12
4,NaN,8.0,NaN,140.0,3449,10.5,70,1,ford torino,11.5,1157.625,10
5,NaN,8.0,NaN,198.0,4341,10.0,70,1,ford galaxie 500,11.0,1000.000,10
6,NaN,8.0,NaN,220.0,4354,9.0,70,1,chevrolet impala,10.0,729.000,9
7,14.0,8.0,NaN,215.0,4312,8.5,70,1,plymouth fury iii,9.5,614.125,8
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,11.0,1000.000,10
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,9.5,614.125,8

In [ ]:
head() # you are returning top 5 records 
dropna() # you are asking pandas to remove blank rows and return the data

In [59]:
df1.dropna() # it is returning output (original df1 is not effected)
# df1 = df1.dropna() # to save your changes to df1
# or
# df1.dropna(inplace = True) # commit() # make changes permanent on df1

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col4
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,13.0,1728.000,12
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,12.5,1520.875,11
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,11.0,1000.000,10
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,9.5,614.125,8
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se,11.0,1000.000,10
...,...,...,...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,140.0,86.0,2790,15.6,82,1,ford mustang gl,16.6,3796.416,15
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,26.6,14886.936,24
394,32.0,4.0,135.0,84.0,2295,11.6,82,1,dodge rampage,12.6,1560.896,11
395,28.0,4.0,120.0,79.0,2625,18.6,82,1,ford ranger,19.6,6434.856,18
396,31.0,4.0,119.0,82.0,2720,19.4,82,1,chevy s-10,20.4,7301.384,19

In [60]:
383/397

0.964735516372796

In [61]:
df1.shape

(397, 12)

In [62]:
# to replace missing values use mean/median/mode ( stat parameters )

In [63]:
df1['mpg'].mean() # average

23.611734693877548

In [64]:
df1['mpg'] = df1['mpg'].fillna(23.611734693877548)
df1.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col4
0,18.000000,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,13.0,1728.000,12
1,15.000000,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,12.5,1520.875,11
2,23.611735,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,12.0,1331.000,11
3,23.611735,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,13.0,1728.000,12
4,23.611735,8.0,NaN,140.0,3449,10.5,70,1,ford torino,11.5,1157.625,10
5,23.611735,8.0,NaN,198.0,4341,10.0,70,1,ford galaxie 500,11.0,1000.000,10
6,23.611735,8.0,NaN,220.0,4354,9.0,70,1,chevrolet impala,10.0,729.000,9
7,14.000000,8.0,NaN,215.0,4312,8.5,70,1,plymouth fury iii,9.5,614.125,8
8,14.000000,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,11.0,1000.000,10
9,15.000000,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,9.5,614.125,8

In [65]:
df1['displacement'] = df1['displacement'].fillna(df1['displacement'].mean()) # We are applying function called fillna
df1.head(10) # We are observing is it applied or not # check

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col4
0,18.000000,8.0,307.000000,130.0,3504,12.0,70,1,chevrolet chevelle malibu,13.0,1728.000,12
1,15.000000,8.0,350.000000,165.0,3693,11.5,70,1,buick skylark 320,12.5,1520.875,11
2,23.611735,8.0,318.000000,150.0,3436,11.0,70,1,plymouth satellite,12.0,1331.000,11
3,23.611735,8.0,191.080357,150.0,3433,12.0,70,1,amc rebel sst,13.0,1728.000,12
4,23.611735,8.0,191.080357,140.0,3449,10.5,70,1,ford torino,11.5,1157.625,10
5,23.611735,8.0,191.080357,198.0,4341,10.0,70,1,ford galaxie 500,11.0,1000.000,10
6,23.611735,8.0,191.080357,220.0,4354,9.0,70,1,chevrolet impala,10.0,729.000,9
7,14.000000,8.0,191.080357,215.0,4312,8.5,70,1,plymouth fury iii,9.5,614.125,8
8,14.000000,8.0,455.000000,225.0,4425,10.0,70,1,pontiac catalina,11.0,1000.000,10
9,15.000000,8.0,390.000000,190.0,3850,8.5,70,1,amc ambassador dpl,9.5,614.125,8

In [69]:
# to drop un necessary columns 
# by default pandas perform operation on rows
df1.drop('col1', axis = 1, inplace = True) # drop col1 in columns (axis = 1) and make the change permanent ( inplace = True)

In [70]:
df1

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col2,col4
0,18.000000,8.0,307.000000,130.0,3504,12.0,70,1,chevrolet chevelle malibu,1728.000,12
1,15.000000,8.0,350.000000,165.0,3693,11.5,70,1,buick skylark 320,1520.875,11
2,23.611735,8.0,318.000000,150.0,3436,11.0,70,1,plymouth satellite,1331.000,11
3,23.611735,8.0,191.080357,150.0,3433,12.0,70,1,amc rebel sst,1728.000,12
4,23.611735,8.0,191.080357,140.0,3449,10.5,70,1,ford torino,1157.625,10
...,...,...,...,...,...,...,...,...,...,...,...
392,27.000000,4.0,140.000000,86.0,2790,15.6,82,1,ford mustang gl,3796.416,15
393,44.000000,4.0,97.000000,52.0,2130,24.6,82,2,vw pickup,14886.936,24
394,32.000000,4.0,135.000000,84.0,2295,11.6,82,1,dodge rampage,1560.896,11
395,28.000000,4.0,120.000000,79.0,2625,18.6,82,1,ford ranger,6434.856,18
396,31.000000,4.0,119.000000,82.0,2720,19.4,82,1,chevy s-10,7301.384,19

In [71]:
df1.drop(['col2','col4'], axis = 1, inplace = True)
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.000000,8.0,307.000000,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.000000,8.0,350.000000,165.0,3693,11.5,70,1,buick skylark 320
2,23.611735,8.0,318.000000,150.0,3436,11.0,70,1,plymouth satellite
3,23.611735,8.0,191.080357,150.0,3433,12.0,70,1,amc rebel sst
4,23.611735,8.0,191.080357,140.0,3449,10.5,70,1,ford torino

In [ ]:
# if you are getting key error --> that column doesnt exists in df1 ( case sensitve, spelling )

In [72]:
# Rename columns

In [73]:
df1.rename({'Horse Power': 'horse power'}, axis = 1, inplace = True)
# axis = 0 --> rows 
# axis =1 --> columns

In [74]:
df1.head()

,mpg,cylinders,displacement,horse power,weight,acceleration,year,origin,name
0,18.000000,8.0,307.000000,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.000000,8.0,350.000000,165.0,3693,11.5,70,1,buick skylark 320
2,23.611735,8.0,318.000000,150.0,3436,11.0,70,1,plymouth satellite
3,23.611735,8.0,191.080357,150.0,3433,12.0,70,1,amc rebel sst
4,23.611735,8.0,191.080357,140.0,3449,10.5,70,1,ford torino

#### Data Manipulation

In [75]:
# taking subset in data frame

In [76]:
df1.head(10)

,mpg,cylinders,displacement,horse power,weight,acceleration,year,origin,name
0,18.000000,8.0,307.000000,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.000000,8.0,350.000000,165.0,3693,11.5,70,1,buick skylark 320
2,23.611735,8.0,318.000000,150.0,3436,11.0,70,1,plymouth satellite
3,23.611735,8.0,191.080357,150.0,3433,12.0,70,1,amc rebel sst
4,23.611735,8.0,191.080357,140.0,3449,10.5,70,1,ford torino
5,23.611735,8.0,191.080357,198.0,4341,10.0,70,1,ford galaxie 500
6,23.611735,8.0,191.080357,220.0,4354,9.0,70,1,chevrolet impala
7,14.000000,8.0,191.080357,215.0,4312,8.5,70,1,plymouth fury iii
8,14.000000,8.0,455.000000,225.0,4425,10.0,70,1,pontiac catalina
9,15.000000,8.0,390.000000,190.0,3850,8.5,70,1,amc ambassador dpl

In [77]:
# iloc:
# Use index values to take subset
# end value is not included
df1.iloc[1:9,3:6] # index location

   horse power  weight  acceleration
1        165.0    3693          11.5
2        150.0    3436          11.0
3        150.0    3433          12.0
4        140.0    3449          10.5
5        198.0    4341          10.0
6        220.0    4354           9.0
7        215.0    4312           8.5
8        225.0    4425          10.0

In [ ]:
# loc 
# it uses names  ( if rows doesnt have names then numbers will be used as names )
# end value is included

In [78]:
df1.loc[1:8, 'horse power': 'acceleration']

   horse power  weight  acceleration
1        165.0    3693          11.5
2        150.0    3436          11.0
3        150.0    3433          12.0
4        140.0    3449          10.5
5        198.0    4341          10.0
6        220.0    4354           9.0
7        215.0    4312           8.5
8        225.0    4425          10.0

In [79]:
df1.loc[1:8, ['horse power', 'acceleration']]

   horse power  acceleration
1        165.0          11.5
2        150.0          11.0
3        150.0          12.0
4        140.0          10.5
5        198.0          10.0
6        220.0           9.0
7        215.0           8.5
8        225.0          10.0

In [80]:
df1.head(2)

,mpg,cylinders,displacement,horse power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320

In [82]:
res = []
for i in df1['weight']:
    if i%2 == 0:
        res.append('Even')
    else:
        res.append('Odd')
df1['col1'] = res
df1.head()

,mpg,cylinders,displacement,horse power,weight,acceleration,year,origin,name,col1
0,18.000000,8.0,307.000000,130.0,3504,12.0,70,1,chevrolet chevelle malibu,Even
1,15.000000,8.0,350.000000,165.0,3693,11.5,70,1,buick skylark 320,Odd
2,23.611735,8.0,318.000000,150.0,3436,11.0,70,1,plymouth satellite,Even
3,23.611735,8.0,191.080357,150.0,3433,12.0,70,1,amc rebel sst,Odd
4,23.611735,8.0,191.080357,140.0,3449,10.5,70,1,ford torino,Odd

In [84]:
def evn_odd(i):
    if i%2 == 0:
        return 'Even'
    else:
        return 'Odd'

In [86]:
evn_odd(2)

'Even'

In [88]:
df1['col2'] = df1['weight'].apply(evn_odd)
df1.head()

,mpg,cylinders,displacement,horse power,weight,acceleration,year,origin,name,col1,col2
0,18.000000,8.0,307.000000,130.0,3504,12.0,70,1,chevrolet chevelle malibu,Even,Even
1,15.000000,8.0,350.000000,165.0,3693,11.5,70,1,buick skylark 320,Odd,Odd
2,23.611735,8.0,318.000000,150.0,3436,11.0,70,1,plymouth satellite,Even,Even
3,23.611735,8.0,191.080357,150.0,3433,12.0,70,1,amc rebel sst,Odd,Odd
4,23.611735,8.0,191.080357,140.0,3449,10.5,70,1,ford torino,Odd,Odd

In [89]:
# one time execution but dont want use loops

df1['col3'] =  df1['weight'].apply(lambda num: 'Even' if num%2 == 0 else 'Odd')
df1.head()

,mpg,cylinders,displacement,horse power,weight,acceleration,year,origin,name,col1,col2,col3
0,18.000000,8.0,307.000000,130.0,3504,12.0,70,1,chevrolet chevelle malibu,Even,Even,Even
1,15.000000,8.0,350.000000,165.0,3693,11.5,70,1,buick skylark 320,Odd,Odd,Odd
2,23.611735,8.0,318.000000,150.0,3436,11.0,70,1,plymouth satellite,Even,Even,Even
3,23.611735,8.0,191.080357,150.0,3433,12.0,70,1,amc rebel sst,Odd,Odd,Odd
4,23.611735,8.0,191.080357,140.0,3449,10.5,70,1,ford torino,Odd,Odd,Odd

In [90]:
df1['col4'] =  df1['acceleration'].apply(lambda num: num **2)
df1.head()

,mpg,cylinders,displacement,horse power,weight,acceleration,year,origin,name,col1,col2,col3,col4
0,18.000000,8.0,307.000000,130.0,3504,12.0,70,1,chevrolet chevelle malibu,Even,Even,Even,144.00
1,15.000000,8.0,350.000000,165.0,3693,11.5,70,1,buick skylark 320,Odd,Odd,Odd,132.25
2,23.611735,8.0,318.000000,150.0,3436,11.0,70,1,plymouth satellite,Even,Even,Even,121.00
3,23.611735,8.0,191.080357,150.0,3433,12.0,70,1,amc rebel sst,Odd,Odd,Odd,144.00
4,23.611735,8.0,191.080357,140.0,3449,10.5,70,1,ford torino,Odd,Odd,Odd,110.25

In [91]:
import pandas as pd
df1 = pd.read_csv('Auto.csv')
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [92]:
df1.isnull().sum()

mpg             5
cylinders       3
displacement    5
Horse Power     0
weight          0
acceleration    0
year            0
origin          0
name            0
dtype: int64

In [93]:
df1.dropna(inplace = True)

In [94]:
df1

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
8,14.0,8.0,455.0,225,4425,10.0,70,1,pontiac catalina
9,15.0,8.0,390.0,190,3850,8.5,70,1,amc ambassador dpl
10,15.0,8.0,383.0,170,3563,10.0,70,1,dodge challenger se
...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
393,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
394,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

In [95]:
# to correct index values --> reset_index()

In [96]:
df1.reset_index() #old index is getting saved as new column

,index,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,8,14.0,8.0,455.0,225,4425,10.0,70,1,pontiac catalina
3,9,15.0,8.0,390.0,190,3850,8.5,70,1,amc ambassador dpl
4,10,15.0,8.0,383.0,170,3563,10.0,70,1,dodge challenger se
...,...,...,...,...,...,...,...,...,...,...
383,392,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
384,393,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
385,394,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
386,395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
387,396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

In [98]:
df1.reset_index(drop = True) # drop = True --> old index will not be saved

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,14.0,8.0,455.0,225,4425,10.0,70,1,pontiac catalina
3,15.0,8.0,390.0,190,3850,8.5,70,1,amc ambassador dpl
4,15.0,8.0,383.0,170,3563,10.0,70,1,dodge challenger se
...,...,...,...,...,...,...,...,...,...
383,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
384,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
385,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
386,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
387,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

In [100]:
# df1 = df1.reset_index(drop = True)
# or 
df1.reset_index(drop = True, inplace = True)

In [101]:
df1

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,14.0,8.0,455.0,225,4425,10.0,70,1,pontiac catalina
3,15.0,8.0,390.0,190,3850,8.5,70,1,amc ambassador dpl
4,15.0,8.0,383.0,170,3563,10.0,70,1,dodge challenger se
...,...,...,...,...,...,...,...,...,...
383,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
384,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
385,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
386,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
387,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

In [102]:
df1.to_excel('output.xlsx', index = False)

In [103]:
pwd

'/Users/trainer/30-08-2025_8pm'

In [ ]:
# this output.xlsx is saved in '/Users/trainer/30-08-2025_8pm'